<?xml version="1.0"?>
<net name="Model0" version="11">
<layers>
<layer id="0" name="x" type="Parameter" version="opset1">
<data shape="1,3,640,640" element_type="f32"/>
<output>
<port id="0" precision="FP32" names="x">
<dim>1</dim>
<dim>3</dim>
<dim>640</dim>
<dim>640</dim>
</port>
</output>
</layer>
<layer id="1" name="__module.model.22/aten::unsqueeze/Unsqueeze" type="Const" version="opset1">
<data element_type="f32" shape="1, 2, 8400" offset="0" size="67200"/>
<output>
<port id="0" precision="FP32" names="940,anchor_points">
<dim>1</dim>
<dim>2</dim>
<dim>8400</dim>
</port>
</output>
</layer>
<layer id="2" name="x/fq_output_0/input_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="67200" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="3" name="x/fq_output_0/input_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="67204" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="4" name="x/fq_output_0/output_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="67200" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="5" name="x/fq_output_0/output_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="67204" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="6" name="x/fq_output_0" type="FakeQuantize" version="opset1">
<data levels="256" auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>640</dim>
<dim>640</dim>
</port>
<port id="1" precision="FP32"/>
<port id="2" precision="FP32"/>
<port id="3" precision="FP32"/>
<port id="4" precision="FP32"/>
</input>
<output>
<port id="5" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>640</dim>
<dim>640</dim>
</port>
</output>
</layer>
<layer id="7" name="Constant_372515" type="Const" version="opset1">
<data element_type="i8" shape="32, 3, 3, 3" offset="67208" size="864"/>
<output>
<port id="0" precision="I8">
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="8" name="Convert_372516" type="Convert" version="opset1">
<data destination_type="f32"/>
<input>
<port id="0" precision="I8">
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="1" precision="FP32">
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="9" name="Constant_372517" type="Const" version="opset1">
<data element_type="f32" shape="32, 1, 1, 1" offset="68072" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="10" name="__module.model.0.conv/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="11" name="__module.model.0.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>640</dim>
<dim>640</dim>
</port>
<port id="1" precision="FP32">
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>320</dim>
<dim>320</dim>
</port>
</output>
</layer>
<layer id="12" name="__module.model.0.conv/aten::_convolution/Reshape" type="Const" version="opset1">
<data element_type="f32" shape="1, 32, 1, 1" offset="68200" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="13" name="__module.model.0.conv/aten::_convolution/Add" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>320</dim>
<dim>320</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="89_1">
<dim>1</dim>
<dim>32</dim>
<dim>320</dim>
<dim>320</dim>
</port>
</output>
</layer>
<layer id="14" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish" type="Swish" version="opset4">
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>320</dim>
<dim>320</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="89,input.1">
<dim>1</dim>
<dim>32</dim>
<dim>320</dim>
<dim>320</dim>
</port>
</output>
</layer>
<layer id="15" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish/fq_output_0/input_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="68328" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="16" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish/fq_output_0/input_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="68332" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="17" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish/fq_output_0/output_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="68328" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="18" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish/fq_output_0/output_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="68332" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="19" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish/fq_output_0" type="FakeQuantize" version="opset1">
<data levels="256" auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>320</dim>
<dim>320</dim>
</port>
<port id="1" precision="FP32"/>
<port id="2" precision="FP32"/>
<port id="3" precision="FP32"/>
<port id="4" precision="FP32"/>
</input>
<output>
<port id="5" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>320</dim>
<dim>320</dim>
</port>
</output>
</layer>
<layer id="20" name="Constant_372519" type="Const" version="opset1">
<data element_type="i8" shape="64, 32, 3, 3" offset="68336" size="18432"/>
<output>
<port id="0" precision="I8">
<dim>64</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="21" name="Convert_372520" type="Convert" version="opset1">
<data destination_type="f32"/>
<input>
<port id="0" precision="I8">
<dim>64</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="22" name="Constant_372521" type="Const" version="opset1">
<data element_type="f32" shape="64, 1, 1, 1" offset="86768" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="23" name="__module.model.1.conv/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>64</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>64</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="24" name="__module.model.1.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>320</dim>
<dim>320</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="25" name="__module.model.1.conv/aten::_convolution/Reshape" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="87024" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="26" name="__module.model.1.conv/aten::_convolution/Add" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="103_1">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="27" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_1" type="Swish" version="opset4">
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="103,input.5">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="28" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_1/fq_output_0/input_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="87280" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="29" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_1/fq_output_0/input_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="87284" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="30" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_1/fq_output_0/output_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="87280" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="31" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_1/fq_output_0/output_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="87284" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="32" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_1/fq_output_0" type="FakeQuantize" version="opset1">
<data levels="256" auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32"/>
<port id="2" precision="FP32"/>
<port id="3" precision="FP32"/>
<port id="4" precision="FP32"/>
</input>
<output>
<port id="5" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="33" name="Constant_372523" type="Const" version="opset1">
<data element_type="i8" shape="64, 64, 1, 1" offset="87288" size="4096"/>
<output>
<port id="0" precision="I8">
<dim>64</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="34" name="Convert_372524" type="Convert" version="opset1">
<data destination_type="f32"/>
<input>
<port id="0" precision="I8">
<dim>64</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="35" name="Constant_372525" type="Const" version="opset1">
<data element_type="f32" shape="64, 1, 1, 1" offset="91384" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="36" name="__module.model.2.cv1.conv/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>64</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>64</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="37" name="__module.model.2.cv1.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="38" name="__module.model.2.cv1.conv/aten::_convolution/Reshape" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="91640" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="39" name="__module.model.2.cv1.conv/aten::_convolution/Add" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="121_1">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="40" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_2" type="Swish" version="opset4">
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="121,input.9">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="41" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_2/fq_output_0/input_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="91896" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="42" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_2/fq_output_0/input_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="91900" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="43" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_2/fq_output_0/output_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="91896" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="44" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_2/fq_output_0/output_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="91900" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="45" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_2/fq_output_0" type="FakeQuantize" version="opset1">
<data levels="256" auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32"/>
<port id="2" precision="FP32"/>
<port id="3" precision="FP32"/>
<port id="4" precision="FP32"/>
</input>
<output>
<port id="5" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="46" name="109" type="Const" version="opset1">
<data element_type="i64" shape="" offset="91904" size="8"/>
<output>
<port id="0" precision="I64" names="109"/>
</output>
</layer>
<layer id="47" name="Constant_228" type="Const" version="opset1">
<data element_type="i64" shape="2" offset="91912" size="16"/>
<output>
<port id="0" precision="I64">
<dim>2</dim>
</port>
</output>
</layer>
<layer id="48" name="__module.model.2/aten::split_with_sizes/VariadicSplit" type="VariadicSplit" version="opset1">
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="I64"/>
<port id="2" precision="I64">
<dim>2</dim>
</port>
</input>
<output>
<port id="3" precision="FP32" names="125">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="4" precision="FP32" names="126,input.11">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="49" name="Constant_372527" type="Const" version="opset1">
<data element_type="i8" shape="32, 32, 3, 3" offset="91928" size="9216"/>
<output>
<port id="0" precision="I8">
<dim>32</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="50" name="Convert_372528" type="Convert" version="opset1">
<data destination_type="f32"/>
<input>
<port id="0" precision="I8">
<dim>32</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="1" precision="FP32">
<dim>32</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="51" name="Constant_372529" type="Const" version="opset1">
<data element_type="f32" shape="32, 1, 1, 1" offset="101144" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="52" name="__module.model.2.m.0.cv1.conv/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>32</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>32</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="53" name="__module.model.2.m.0.cv1.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32">
<dim>32</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="54" name="__module.model.2.m.0.cv1.conv/aten::_convolution/Reshape" type="Const" version="opset1">
<data element_type="f32" shape="1, 32, 1, 1" offset="101272" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="55" name="__module.model.2.m.0.cv1.conv/aten::_convolution/Add" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="136_1">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="56" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_3" type="Swish" version="opset4">
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="136,input.13">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="57" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_3/fq_output_0/input_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="101400" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="58" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_3/fq_output_0/input_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="101404" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="59" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_3/fq_output_0/output_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="101400" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="60" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_3/fq_output_0/output_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="101404" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="61" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_3/fq_output_0" type="FakeQuantize" version="opset1">
<data levels="256" auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32"/>
<port id="2" precision="FP32"/>
<port id="3" precision="FP32"/>
<port id="4" precision="FP32"/>
</input>
<output>
<port id="5" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="62" name="Constant_372531" type="Const" version="opset1">
<data element_type="i8" shape="32, 32, 3, 3" offset="101408" size="9216"/>
<output>
<port id="0" precision="I8">
<dim>32</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="63" name="Convert_372532" type="Convert" version="opset1">
<data destination_type="f32"/>
<input>
<port id="0" precision="I8">
<dim>32</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="1" precision="FP32">
<dim>32</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="64" name="Constant_372533" type="Const" version="opset1">
<data element_type="f32" shape="32, 1, 1, 1" offset="110624" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="65" name="__module.model.2.m.0.cv2.conv/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>32</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>32</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="66" name="__module.model.2.m.0.cv2.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32">
<dim>32</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="67" name="__module.model.2.m.0.cv2.conv/aten::_convolution/Reshape" type="Const" version="opset1">
<data element_type="f32" shape="1, 32, 1, 1" offset="110752" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="68" name="__module.model.2.m.0.cv2.conv/aten::_convolution/Add" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="145_1">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="69" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_4" type="Swish" version="opset4">
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="145,input.17">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="70" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_4/fq_output_0/input_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="87280" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="71" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_4/fq_output_0/input_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="110880" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="72" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_4/fq_output_0/output_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="87280" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="73" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_4/fq_output_0/output_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="110880" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="74" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_4/fq_output_0" type="FakeQuantize" version="opset1">
<data levels="256" auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32"/>
<port id="2" precision="FP32"/>
<port id="3" precision="FP32"/>
<port id="4" precision="FP32"/>
</input>
<output>
<port id="5" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="75" name="__module.model.2.m.0/aten::add/Add" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="147">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="76" name="__module.model.2.m.0/aten::add/Add/fq_output_0/input_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="91896" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="77" name="__module.model.2.m.0/aten::add/Add/fq_output_0/input_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="91900" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="78" name="__module.model.2.m.0/aten::add/Add/fq_output_0/output_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="91896" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="79" name="__module.model.2.m.0/aten::add/Add/fq_output_0/output_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="91900" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="80" name="__module.model.2.m.0/aten::add/Add/fq_output_0" type="FakeQuantize" version="opset1">
<data levels="256" auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32"/>
<port id="2" precision="FP32"/>
<port id="3" precision="FP32"/>
<port id="4" precision="FP32"/>
</input>
<output>
<port id="5" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="81" name="__module.model.2/aten::cat/Concat" type="Concat" version="opset1">
<data axis="1"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</input>
<output>
<port id="3" precision="FP32" names="149,input.19">
<dim>1</dim>
<dim>96</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="82" name="Constant_372535" type="Const" version="opset1">
<data element_type="i8" shape="64, 96, 1, 1" offset="110884" size="6144"/>
<output>
<port id="0" precision="I8">
<dim>64</dim>
<dim>96</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="83" name="Convert_372536" type="Convert" version="opset1">
<data destination_type="f32"/>
<input>
<port id="0" precision="I8">
<dim>64</dim>
<dim>96</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>96</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="84" name="Constant_372537" type="Const" version="opset1">
<data element_type="f32" shape="64, 1, 1, 1" offset="117028" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="85" name="__module.model.2.cv2.conv/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>64</dim>
<dim>96</dim>
<dim>1</dim>
<dim>1</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>64</dim>
<dim>96</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="86" name="__module.model.2.cv2.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>96</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>96</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="87" name="__module.model.2.cv2.conv/aten::_convolution/Reshape" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="117284" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="88" name="__module.model.2.cv2.conv/aten::_convolution/Add" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="157_1">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="89" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_5" type="Swish" version="opset4">
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="157,input.21">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="90" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_5/fq_output_0/input_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="117540" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="91" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_5/fq_output_0/input_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="117544" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="92" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_5/fq_output_0/output_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="117540" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="93" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_5/fq_output_0/output_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="117544" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="94" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_5/fq_output_0" type="FakeQuantize" version="opset1">
<data levels="256" auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32"/>
<port id="2" precision="FP32"/>
<port id="3" precision="FP32"/>
<port id="4" precision="FP32"/>
</input>
<output>
<port id="5" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
</output>
</layer>
<layer id="95" name="Constant_372539" type="Const" version="opset1">
<data element_type="i8" shape="128, 64, 3, 3" offset="117548" size="73728"/>
<output>
<port id="0" precision="I8">
<dim>128</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="96" name="Convert_372540" type="Convert" version="opset1">
<data destination_type="f32"/>
<input>
<port id="0" precision="I8">
<dim>128</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="1" precision="FP32">
<dim>128</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="97" name="Constant_372541" type="Const" version="opset1">
<data element_type="f32" shape="128, 1, 1, 1" offset="191276" size="512"/>
<output>
<port id="0" precision="FP32">
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="98" name="__module.model.3.conv/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>128</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>128</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="99" name="__module.model.3.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>160</dim>
<dim>160</dim>
</port>
<port id="1" precision="FP32">
<dim>128</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="100" name="__module.model.3.conv/aten::_convolution/Reshape" type="Const" version="opset1">
<data element_type="f32" shape="1, 128, 1, 1" offset="191788" size="512"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="101" name="__module.model.3.conv/aten::_convolution/Add" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="171_1">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="102" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_6" type="Swish" version="opset4">
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="171,input.25">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="103" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_6/fq_output_0/input_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="192300" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="104" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_6/fq_output_0/input_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="192304" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="105" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_6/fq_output_0/output_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="192300" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="106" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_6/fq_output_0/output_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="192304" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="107" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_6/fq_output_0" type="FakeQuantize" version="opset1">
<data levels="256" auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
<port id="1" precision="FP32"/>
<port id="2" precision="FP32"/>
<port id="3" precision="FP32"/>
<port id="4" precision="FP32"/>
</input>
<output>
<port id="5" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="108" name="Constant_372543" type="Const" version="opset1">
<data element_type="i8" shape="128, 128, 1, 1" offset="192308" size="16384"/>
<output>
<port id="0" precision="I8">
<dim>128</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="109" name="Convert_372544" type="Convert" version="opset1">
<data destination_type="f32"/>
<input>
<port id="0" precision="I8">
<dim>128</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="1" precision="FP32">
<dim>128</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="110" name="Constant_372545" type="Const" version="opset1">
<data element_type="f32" shape="128, 1, 1, 1" offset="208692" size="512"/>
<output>
<port id="0" precision="FP32">
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="111" name="__module.model.4.cv1.conv/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>128</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
<port id="1" precision="FP32">
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>128</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="112" name="__module.model.4.cv1.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
<port id="1" precision="FP32">
<dim>128</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="113" name="__module.model.4.cv1.conv/aten::_convolution/Reshape" type="Const" version="opset1">
<data element_type="f32" shape="1, 128, 1, 1" offset="209204" size="512"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="114" name="__module.model.4.cv1.conv/aten::_convolution/Add" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="191_1">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="115" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_7" type="Swish" version="opset4">
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="191,input.29">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="116" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_7/fq_output_0/input_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="209716" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="117" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_7/fq_output_0/input_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="209720" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="118" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_7/fq_output_0/output_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="209716" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="119" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_7/fq_output_0/output_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="209720" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="120" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_7/fq_output_0" type="FakeQuantize" version="opset1">
<data levels="256" auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
<port id="1" precision="FP32"/>
<port id="2" precision="FP32"/>
<port id="3" precision="FP32"/>
<port id="4" precision="FP32"/>
</input>
<output>
<port id="5" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="121" name="177" type="Const" version="opset1">
<data element_type="i64" shape="" offset="91904" size="8"/>
<output>
<port id="0" precision="I64" names="177"/>
</output>
</layer>
<layer id="122" name="Constant_510" type="Const" version="opset1">
<data element_type="i64" shape="2" offset="209724" size="16"/>
<output>
<port id="0" precision="I64">
<dim>2</dim>
</port>
</output>
</layer>
<layer id="123" name="__module.model.4/aten::split_with_sizes/VariadicSplit" type="VariadicSplit" version="opset1">
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>80</dim>
<dim>80</dim>
</port>
<port id="1" precision="I64"/>
<port id="2" precision="I64">
<dim>2</dim>
</port>
</input>
<output>
<port id="3" precision="FP32" names="195">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
<port id="4" precision="FP32" names="196,input.31">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="124" name="Constant_372547" type="Const" version="opset1">
<data element_type="i8" shape="64, 64, 3, 3" offset="209740" size="36864"/>
<output>
<port id="0" precision="I8">
<dim>64</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="125" name="Convert_372548" type="Convert" version="opset1">
<data destination_type="f32"/>
<input>
<port id="0" precision="I8">
<dim>64</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="126" name="Constant_372549" type="Const" version="opset1">
<data element_type="f32" shape="64, 1, 1, 1" offset="246604" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="127" name="__module.model.4.m.0.cv1.conv/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>64</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>64</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="128" name="__module.model.4.m.0.cv1.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="129" name="__module.model.4.m.0.cv1.conv/aten::_convolution/Reshape" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="246860" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="130" name="__module.model.4.m.0.cv1.conv/aten::_convolution/Add" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="206_1">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="131" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_8" type="Swish" version="opset4">
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="206,input.33">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="132" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_8/fq_output_0/input_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="247116" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="133" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_8/fq_output_0/input_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="247120" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="134" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_8/fq_output_0/output_low" type="Const" version="opset1">
<data element_type="f32" shape="" offset="247116" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="135" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_8/fq_output_0/output_high" type="Const" version="opset1">
<data element_type="f32" shape="" offset="247120" size="4"/>
<output>
<port id="0" precision="FP32"/>
</output>
</layer>
<layer id="136" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_8/fq_output_0" type="FakeQuantize" version="opset1">
<data levels="256" auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
<port id="1" precision="FP32"/>
<port id="2" precision="FP32"/>
<port id="3" precision="FP32"/>
<port id="4" precision="FP32"/>
</input>
<output>
<port id="5" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="137" name="Constant_372551" type="Const" version="opset1">
<data element_type="i8" shape="64, 64, 3, 3" offset="247124" size="36864"/>
<output>
<port id="0" precision="I8">
<dim>64</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="138" name="Convert_372552" type="Convert" version="opset1">
<data destination_type="f32"/>
<input>
<port id="0" precision="I8">
<dim>64</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="139" name="Constant_372553" type="Const" version="opset1">
<data element_type="f32" shape="64, 1, 1, 1" offset="283988" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="140" name="__module.model.4.m.0.cv2.conv/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>64</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>64</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="141" name="__module.model.4.m.0.cv2.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="142" name="__module.model.4.m.0.cv2.conv/aten::_convolution/Reshape" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="284244" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="143" name="__module.model.4.m.0.cv2.conv/aten::_convolution/Add" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="215_1">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</output>
</layer>
<layer id="144" name="__module.model.22.cv3.2.1.act/aten::silu_/Swish_9" type="Swish" version="opset4">
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="215,input.37">
<dim>1</dim>
<dim>64</dim>
<dim>80</dim>
<dim>80</dim>
